# frozen_string_literal: true

passengers = [
  {
    "Билет №": 'РМ2010398 050298',
    "Маршрут": 'Москва -> Петушки',
    "Пассажир": 'Венедикт В. Ерофеев',
    "Паспорт": '45 99 505281'
  },
  {
    "Билет №": 'РМ2010399 050298',
    "Маршрут": 'Павловский Посад -> Орехово-Зуево',
    "Пассажир": 'Иннокентий П. Шниперсон',
    "Паспорт": '46 01 192872'
  },
  {
    "Билет №": 'РМ2010399 050298',
    "Маршрут": 'Москва -> Владимир',
    "Пассажир": 'Иван В. Бунша',
    "Паспорт": '47 33 912876'
  }
]

passengers.each_with_index do |obj, i|
  puts "* * * Место № #{i + 1} * * *"
  obj.each { |k, v| puts "#{k}: #{v}" }
end
